readme.org
#+title: mleml
#+author: Alsai Samo (imikoy)

* Introduction
This is a framework library for processing music macro language (MML).

It can be used for:
1. Simple players/compilers
2. Somewhat complex environments for working with audio
3. Resource-providing libraries

** What's included
+ Data types
+ Main traits (Resource, Mod, Channel, Mixer)
+ Some builtin resources
  These can be used as they are or as examples.
** TODOs
+ [ ] Tests
+ [ ] Better usage examples
+ [ ] Resources should provide schema
+ [ ] Provide aid with config validation
