readme.md

# Table of Contents

1.  [Introduction](#org11597b7)
    1.  [What&rsquo;s included](#orga91a666)
    2.  [TODOs](#org739357c)



<a id="org11597b7"></a>

# Introduction

This is a framework library for processing music macro language (MML).

It can be used for:

1.  Simple players/compilers
2.  Somewhat complex environments for working with audio
3.  Resource-providing libraries


<a id="orga91a666"></a>

## What&rsquo;s included

-   Data types
-   Main traits (Resource, Mod, Channel, Mixer)
-   Some builtin resources
    These can be used as they are or as examples.


<a id="org739357c"></a>

## TODOs

-   [ ] Tests
-   [ ] Better usage examples
-   [ ] Resources should provide schema
-   [ ] Provide aid with config validation

